export default {
  projections: {
    ТоварыE: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      количество: {
        __caption__: 'Количество'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      товар: {
        __caption__: 'Товар',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    код: {
      __caption__: 'Код'
    },
    количество: {
      __caption__: 'Количество'
    },
    наименование: {
      __caption__: 'Наименование'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    товар: {
      __caption__: 'Товар'
    },
    заказ: {
      __caption__: 'заказ'
    }
  }
};
