export default {
  projections: {
    МенеджерE: {
      кодМенеджера: {
        __caption__: 'Код менеджера'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      номерПаспорта: {
        __caption__: 'Номер паспорта'
      },
      серияПаспорта: {
        __caption__: 'Серия паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      }
    },
    МенеджерL: {
      кодМенеджера: {
        __caption__: 'Код менеджера'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      номерПаспорта: {
        __caption__: 'Номер паспорта'
      },
      серияПаспорта: {
        __caption__: 'Серия паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодМенеджера: {
      __caption__: 'Код менеджера'
    },
    номерПаспорта: {
      __caption__: 'Номер паспорта'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    серияПаспорта: {
      __caption__: 'Серия паспорта'
    },
    телефон: {
      __caption__: 'Телефон'
    },
    фамилия: {
      __caption__: 'Фамилия'
    }
  }
};
