export default {
  projections: {
    ПоставщикE: {
      кодПоставщика: {
        __caption__: 'Код поставщика'
      },
      поствщик: {
        __caption__: 'Поствщик'
      },
      телефон: {
        __caption__: 'Телефон'
      }
    },
    ПоставщикL: {
      кодПоставщика: {
        __caption__: 'Код поставщика'
      },
      поствщик: {
        __caption__: 'Поствщик'
      },
      телефон: {
        __caption__: 'Телефон'
      }
    }
  },
  validations: {
    кодПоставщика: {
      __caption__: 'Код поставщика'
    },
    поствщик: {
      __caption__: 'Поствщик'
    },
    телефон: {
      __caption__: 'Телефон'
    }
  }
};
