export default {
  projections: {
    ПроизводительE: {
      кодПроизвод: {
        __caption__: 'Код производ'
      },
      производитель: {
        __caption__: 'Производитель'
      },
      страна: {
        __caption__: 'Страна'
      }
    },
    ПроизводительL: {
      кодПроизвод: {
        __caption__: 'Код производ'
      },
      производитель: {
        __caption__: 'Производитель'
      },
      страна: {
        __caption__: 'Страна'
      }
    }
  },
  validations: {
    кодПроизвод: {
      __caption__: 'Код производ'
    },
    производитель: {
      __caption__: 'Производитель'
    },
    страна: {
      __caption__: 'Страна'
    }
  }
};
