export default {
  projections: {
    ЗаказE: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      доставка: {
        __caption__: 'Доставка'
      },
      клиент: {
        __caption__: 'Клиент',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      менеджер: {
        __caption__: 'Менеджер',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      товары: {
        __caption__: 'Товары',
        код: {
          __caption__: 'Код'
        },
        наименование: {
          __caption__: 'Наименование'
        },
        количество: {
          __caption__: 'Количество'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        товар: {
          __caption__: 'Товар',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      },
      состояниеЗаказа: {
        __caption__: 'Состояние заказа',
        кодСостояния: {
          __caption__: 'Код состояния'
        },
        дата: {
          __caption__: 'Дата'
        },
        статус: {
          __caption__: 'Статус'
        }
      }
    },
    ЗаказL: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      доставка: {
        __caption__: 'Доставка'
      },
      клиент: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      менеджер: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    доставка: {
      __caption__: 'Доставка'
    },
    кодЗаказа: {
      __caption__: 'Код заказа'
    },
    номерЗаказа: {
      __caption__: 'Номер заказа'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    менеджер: {
      __caption__: 'Менеджер'
    },
    товары: {
      __caption__: 'Товары'
    },
    состояниеЗаказа: {
      __caption__: 'Состояние заказа'
    }
  }
};
